Revit.Elements.Dimension.ByElements(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Revit.Elements.Element},Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Construct a Revit Linear Dimension from at least two elements.
view: View to place dimension in
referenceElements: Elements to dimension
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns: Dimension

Revit.Elements.Dimension.ByFaces(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface},Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Construct a Revit Linear Dimension from at least two Faces.
view: View to place dimension in
referenceSurfaces: Faces to dimension
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns:

Revit.Elements.Dimension.ByEdges(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Construct a Revit Linear Dimension from at least two Edges.
view: View to place dimension in
referenceCurves: Edges to dimension
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns:

Revit.Elements.Dimension.ByReferences(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Revit.GeometryReferences.ElementGeometryReference},Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Construct a Revit Linear Dimension from at least two ElementGeometryReference.
view: View to place dimension in
referenceGeometries: References to dimension, e.g. ElementCurveReference and ElementFaceReference
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns:

Revit.Elements.Dimension.ByElementDirection(Revit.Elements.Views.View,Revit.Elements.Element,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Create a Dimension for an Element in the specified direction and view.
view: View to place dimension in
element: The element of generated Dimension
direction: The direction to create Dimension
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns: